### Covid Nashville Project

#### Import library

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from credentials import user, password, server

In [2]:
engine = create_engine("postgres+psycopg2://"+user+":"\
                       +password+"@"\
                       +server+":5432/covid_data")

In [3]:
colleges = pd.read_sql("SELECT * FROM colleges;", con=engine)
colleges.head()

,date,state,county,city,ipeds_id,college,cases,notes
0,2020-11-05,Alabama,Madison,Huntsville,100654,Alabama A&M University,41.0,None
1,2020-11-05,Alabama,Montgomery,Montgomery,100724,Alabama State University,NaN,None
2,2020-11-05,Alabama,Limestone,Athens,100812,Athens State University,23.0,None
3,2020-11-05,Alabama,Lee,Auburn,100858,Auburn University,2047.0,None
4,2020-11-05,Alabama,Montgomery,Montgomery,100830,Auburn University at Montgomery,80.0,None

In [4]:
counties = pd.read_sql("SELECT * FROM counties;", con=engine)
counties.head()

         date     county       state   fips  cases  deaths
0  2020-01-21  Snohomish  Washington  53061      1       0
1  2020-01-22  Snohomish  Washington  53061      1       0
2  2020-01-23  Snohomish  Washington  53061      1       0
3  2020-01-24       Cook    Illinois  17031      1       0
4  2020-01-24  Snohomish  Washington  53061      1       0

In [5]:
tennessee_counties = counties[counties['state'] == 'Tennessee']
tennessee_counties.head()

           date      county      state   fips  cases  deaths
570  2020-03-05  Williamson  Tennessee  47187      1       0
639  2020-03-06  Williamson  Tennessee  47187      1       0
731  2020-03-07  Williamson  Tennessee  47187      1       0
841  2020-03-08    Davidson  Tennessee  47037      1       0
842  2020-03-08      Shelby  Tennessee  47157      1       0

In [6]:
davidson = tennessee_counties[tennessee_counties['county'] == 'Davidson']
davidson.head()

            date    county      state   fips  cases  deaths
841   2020-03-08  Davidson  Tennessee  47037      1       0
970   2020-03-09  Davidson  Tennessee  47037      1       0
1127  2020-03-10  Davidson  Tennessee  47037      1       0
1323  2020-03-11  Davidson  Tennessee  47037      2       0
1569  2020-03-12  Davidson  Tennessee  47037      6       0

In [7]:
mask_use = pd.read_sql("SELECT * FROM mask_use;", con=engine)
mask_use.head()

  county_fips  never  rarely  sometimes  frequently  always
0       01001  0.053   0.074      0.134       0.295   0.444
1       01003  0.083   0.059      0.098       0.323   0.436
2       01005  0.067   0.121      0.120       0.201   0.491
3       01007  0.020   0.034      0.096       0.278   0.572
4       01009  0.053   0.114      0.180       0.194   0.459

In [8]:
states = pd.read_sql("SELECT * FROM states;", con=engine)
states.head()

         date       state fips  cases  deaths
0  2020-01-21  Washington   53      1       0
1  2020-01-22  Washington   53      1       0
2  2020-01-23  Washington   53      1       0
3  2020-01-24    Illinois   17      1       0
4  2020-01-24  Washington   53      1       0

In [9]:
us_totals = pd.read_sql("SELECT * FROM us_totals;", con=engine)
us_totals.head()

         date  cases  deaths
0  2020-01-21      1       0
1  2020-01-22      1       0
2  2020-01-23      1       0
3  2020-01-24      2       0
4  2020-01-25      3       0

In [14]:
businesses_df = pd.read_csv('../data/businesses.csv')
businesses_df.head()

,address,vicinity,name,type
0,"2440 COUCHVILLE PIKE, Nashville","2440 Couchville Pike, Nashville",Wilson Sporting Goods Co,"['point_of_interest', 'establishment']"
1,"1613 Buchanan St, Nashville","1613 Buchanan Street, Nashville",Coin Cloud Bitcoin ATM,"['atm', 'finance', 'point_of_interest', 'estab..."
2,"1613 Buchanan St, Nashville","1613 Buchanan Street, Nashville",Discounts Mart,"['convenience_store', 'food', 'point_of_intere..."
3,"1613 Buchanan St, Nashville","1613 Buchanan Street, Nashville",Northwest Liquors,"['liquor_store', 'point_of_interest', 'store',..."
4,"306 White Bridge Pike, Nashville","306 White Bridge Pike, Nashville",Suds Up Car Wash of West Nashville,"['car_wash', 'point_of_interest', 'establishme..."

In [15]:
type(businesses_df)

pandas.core.frame.DataFrame

In [16]:
clusters_df = pd.read_csv('../data/clusters.csv')
clusters_df.head()

,Cluster Name,Facility Type,Cluster Start Date,# Cases,Latitude,Longitude
0,Vanderbilt Parties,Social Gathering,3/11/2020,49,36.144703,-86.802655
1,Event at Clementine Hall,Social Gathering,3/14/2020,23,36.152444,-86.844583
2,Religious Retreat,Social Gathering,3/25/2020,18,NaN,NaN
3,The Health Center at Richland Place,LTCF,4/3/2020,47,36.128750,-86.817345
4,Trevecca Center for Rehab and Healing,LTCF,4/4/2020,102,36.144562,-86.754560

In [18]:
hubnash_df = pd.read_csv('../data/hubNashville__311__Service_Requests.csv', low_memory=False)
hubnash_df.head()

,Request #,Status,Request Type,Subrequest Type,Additional Subrequest Type,Date / Time Opened,Date / Time Closed,Request Origin,System of Origin ID,Contact Type,...,State Issue,Parent Request,Closed When Created,Address,City,Council District,ZIP,Latitude,Longitude,Mapped Location
0,353977,Closed,COVID-19,COVID-19 - Submit Input about The Plan to Reop...,COVID-19 - Submit Input about The Plan to Reop...,04/28/2020 02:33:22 PM,04/28/2020 02:33:22 PM,hubNashville Community,NaN,NaN,...,False,NaN,True,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,367021,Closed,Resolved by hubNashville on First Call,Resolved by hubNashville on First Call,Resolved by hubNashville on First Call,05/13/2020 09:00:52 PM,05/13/2020 09:00:52 PM,Phone,NaN,NaN,...,False,NaN,True,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,419194,Closed,"Streets, Roads & Sidewalks",Remove debris in roadway,Roadway,07/17/2020 03:21:03 PM,07/28/2020 04:06:19 PM,hubNashville Community,NaN,NaN,...,False,NaN,False,Lafayette St & Claiborne St,NASHVILLE,17.0,37210,36.148412,-86.761179,"(36.1484116, -86.761179)"
3,366600,Closed,Resolved by hubNashville on First Call,Resolved by hubNashville on First Call,Resolved by hubNashville on First Call,05/13/2020 04:04:14 PM,05/13/2020 04:04:14 PM,Phone,NaN,NaN,...,False,NaN,True,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,408945,Closed,Resolved by hubNashville on First Call,Resolved by hubNashville on First Call,Resolved by hubNashville on First Call,07/06/2020 05:57:28 PM,07/06/2020 05:57:28 PM,Phone,NaN,NaN,...,False,NaN,True,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [41]:
hubnash_covid = hubnash_df[hubnash_df['Subrequest Type'] == 'COVID-19 Violaitons']